[{
        "ProductUrl": "https://www.amazon.in/dp/B07KY2WP24/",
        "ProductName": "Scitron Raw Whey (100% Whey Protein Concentrate,24g Protein, 0g Sugar, 33 Servings,9 Essential Amino Acids, No Flavours & Preservatives) - 2.2 lbs (1 kg)",
        "Price": "698.00",
        "ProductFeatures": [
            "Scitron Raw Whey is an unflavoured and unsweetened protein supplement that provides 24g protein per serving of 30g",
            "Loaded with naturally occurring amino acids, it is easily absorbed to maintain and improve lean muscle mass",
            "With no added flavour, Scitron Raw Whey can be used as per your individual taste",
            "Helps to deliver greater gains in strength, muscle and lean body mass to help you get the most out of your training"
        ],
        "Availibility": "In stock on December 16, 2019.",
        "CustomerReviews": "3.5"
    },
    {
        "ProductUrl": "https://www.amazon.in/dp/B07X1JYQT3/",
        "ProductName": "Scitron Raw ISO (100% Whey Protein ISOLATE, 27g Protein, 0g Sugar, 30 Servings, Essential & Non-Essential Amino Acids, No Flavours & Preservatives) - 2 lbs (900g)",
        "Price": "1,149.00",
        "ProductFeatures": [
            "Provon (100% Whey Protein Isolate), which is a registered trademark of Glanbia Nutritionals",
            "Offers clean whey protein isolate with 27g protein ; Deliver greater gains in strength, muscle and lean body mass",
            "6.2g BCAA (naturally occurring) in every serving",
            "No added sugar, colour and flavour and delivers pure, high quality protein",
            "Whey protein enhances glutathione (GSH), whey protein isolate works on enhancing this system, leading to greater performance and increased immunity",
            "Soy Lecithin is used to instantize whey protein isolate during processing, however this is filtered out from the product"
        ],
        "Availibility": "In stock.",
        "CustomerReviews": "3.4"
    },
    {
        "ProductUrl": "https://www.amazon.in/dp/B07X4HCLY1/",
        "ProductName": "Scitron Advance Whey Protein (28.5 Servings, 25.5g Protein, 6g BCAAs, 0g Sugar) – 2.2lbs (1kg) (Milk Chocolate)",
        "Price": "1,873.00",
        "ProductFeatures": [
            "Hydrovon Hydrolyzed Whey Protein Isolate, Provon Whey Protein Isolate, & Avonlac Whey Protein Concentrate - All are registered trademarks of Glanbia Nutritionals",
            "Purest and most premium form of whey protein achieved through the filtration of lactose, carbs and fat",
            "Enhanced with a daily dose of vitamins and minerals to support the daily needs of your workout routine",
            "Easily soluble in a glass or shaker cup, while carefully sourced ingredients give it a delicious taste",
            "Delivers greater gains in strength, muscle and lean body mass to help you get the most out of your training"
        ],
        "Availibility": "In stock.",
        "CustomerReviews": "2.9"
    },
    {
        "ProductUrl": "https://www.amazon.in/dp/B01GFM6XFM/",
        "ProductName": "Muscleblaze 100% Whey Protein Supplement Powder - 4 kg / 8.8 lb (Rich Milk Chocolate)",
        "Price": "5,980.00",
        "ProductFeatures": [
            "MuscleBlaze Whey Protein with 25g protein and 5.5g BCAA per serving makes it the best Whey protein Supplement powder",
            "MuscleBlaze Whey Protein is manufactured using Whey from United States of America ensuring protein quality of international standards",
            "Whey protein Isolate, the major ingredient also considered the most superior form of protein is the primary source of protein with Whey protein concentrate as the secondary source",
            "It comes with added digestive enzymes which help with faster and easier digestion of protein in 4 different flavours namely Rich Milk Chocolate, Cafe Mocha, Vanilla & Strawberry.",
            "Consumers aiming for muscle gain should mix 1 scoop (32g) in 180-200 ml water and take 1-2 shakes per day."
        ],
        "Availibility": "In stock.",
        "CustomerReviews": "3.9"
    },
    {
        "ProductUrl": "https://www.amazon.in/dp/B0821LDPK2/",
        "ProductName": "MuscleBlaze Biozyme Whey Protein (2 Kg, Ice Cream Chocolate)",
        "Price": "3,999.00",
        "ProductFeatures": [
            "Comes with Enhanced absorption formula (EAF) that provides 50% higher protein absorption and 60% higher BCAA absorption when compared to other whey proteins",
            "Biozyme Whey Protein by Muscleblaze is India's first clinically tested Whey Protein product which is proven and tested for Indian bodies",
            "Biozyme Whey Protein lowers the stomach discomfort in the consumers due to enhanced protein absorption",
            "The product delivers 25g of protein per 33g serving which is roughly 76% protein content and is powered by a combination of Whey Protein Isolate and Whey Protein Concentrate",
            "The delectable Ice Cream Chocolate flavour ensures the customer gets the best of both the worlds in terms of taste and efficacy"
        ],
        "Availibility": "In stock.",
        "CustomerReviews": "5.0"
    },
    {
        "ProductUrl": "https://www.amazon.in/dp/B071KWBBXZ/",
        "ProductName": "MuscleBlaze Whey Gold 100% Whey Protein Isolate (Rich Milk Chocolate, 2 kg / 4.4 lb)",
        "Price": "4,479.00",
        "ProductFeatures": [
            "Muscleblaze whey gold is manufactured using whey from united states and delivers 25g of protein per 30g serving",
            "Whey isolate with the highest pdcaa(protein digestibility corrected amino acid) score of 1, the only source in whey gold ensures the highest quality of protein is available to the customer for consumption",
            "Guaranteed protein certificate from a 3rd party lab (nabl accredited) makes it the most authentic product available in the market",
            "With 5.5g bcaa, 1.65g carb and 0.46g fat per serving, this is the most impeccable protein powder supplement available",
            "Customers should mix 1 scoop (30g) in 180-200 ml water for best results"
        ],
        "Availibility": "In stock.",
        "CustomerReviews": "3.8"
    },
    {
        "ProductUrl": "https://www.amazon.in/dp/B07JNCYLMV/",
        "ProductName": "IN2 Whey Protein Café Mocha 500gms",
        "Price": "799.00",
        "ProductFeatures": [
            "Contains BCAA and Glutamine",
            "Supports Muscle recovery and growth",
            "Multiple Quality Whey Proteins",
            "Mixes Easily and Gluten Free",
            "Great Tasting"
        ],
        "Availibility": "In stock.",
        "CustomerReviews": "4.1"
    },
    {
        "ProductUrl": "https://www.amazon.in/dp/B06XGNT22C/",
        "ProductName": "MuscleBlaze Raw Whey Protein Concentrate 80% with added digestive enzymes (Unflavoured, 1 kg / 2.2 lb)",
        "Price": "1,199.00",
        "ProductFeatures": [
            "MuscleBlaze Raw Whey Protein in an unsweetened and unflavoured protein supplement which can be used in whichever way the customer wants - different flavours for each serving, protein cake, protein bar, protein smoothie etc",
            "It delivers 24g protein and 5.2g BCAA per serving (30g) making it a highly effective product for muscle sythesis and gain",
            "Helps to build lean muscle, enhances recovery and reduces muscle loss",
            "Minimal processing ensures the nutrients of the Whey protein are preseved as in the original Whey Protein powder",
            "Multiple Tests guarantee purity of Whey Protein Concentrate in MuscleBlaze Raw Whey health supplement powder"
        ],
        "Availibility": "In stock.",
        "CustomerReviews": "3.9"
    },
    {
        "ProductUrl": "https://www.amazon.in/dp/B002DYIZH6/",
        "ProductName": "Optimum Nutrition (ON) Gold Standard 100% Whey Protein Powder - 2 lbs, 907 g (Double Rich Chocolate)",
        "Price": "2,499.00",
        "ProductFeatures": [
            "24 grams of whey protein per serving with whey protein isolates as the primary ingredient and just 1 gram of sugar and 1 gram of fat",
            "5 grams of naturally occurring BCAAs and over 4 grams of glutamine and glutamic acid in each serving",
            "Whey Protein Microfractions from Whey Protein Isolates & Ultra-Filtered Whey Protein Concentrate",
            "Use first thing in the morning, before/after exercise or after weight training. Shelf Life:24 Months",
            "There is no seal inside the cap,the product has a plastic shrink wrap seal around the cap (outside) for protection from contamination",
            "On all the protein tubs you will find blue ink jet printing listing a manufacturer date, expiration date and batch code. There may be slight difference with the actual product and the images displayed",
            "Brand Customer Care details: Indiacustomercare, contact_us on: 011 49594959. Email ID :indiacustomercare@glanbia.com"
        ],
        "Availibility": "In stock.",
        "CustomerReviews": "3.9"
    },
    {
        "ProductUrl": "https://www.amazon.in/dp/B07VJX85MY/",
        "ProductName": "Bigmuscles Nutrition Crude Whey 1kg, Whey Protein Concentrate 80%, 24g Protein, 5.5g BCAA, 4 g Glutamine",
        "Price": "799.00",
        "ProductFeatures": [
            "Unflavored premium whey protein concentrate sourced from glanbia nutritionals U. S. A",
            "24G of protein per serving, 4g of glutamine per serving and 5. 5G of BCAA per serving",
            "Zero sugar per serving, The trans fat is only 0.02 grams per serving",
            "No soy added",
            "Preservative free",
            "Added 2g Maltodextrin (carbohydrates) per serving that results in better digestion & smooth shake",
            "No artificial enzymes added, only natural carbs to support digestion"
        ],
        "Availibility": "In stock.",
        "CustomerReviews": "3.7"
    },
    {
        "ProductUrl": "https://www.amazon.in/dp/B079SZJJDR/",
        "ProductName": "AS-IT-IS Nutrition Whey Protein Concentrate 80% Unflavoured - 1Kg",
        "Price": "1,183.00",
        "ProductFeatures": [
            "Promotes Muscle Building: Gain Lean Muscles Like Never Before, With Asitis Nutrition Whey Protein. In Its Natural, Raw Form, Whey Protein Is Ideal For Those Who Love An Intense Workout As It Boosts Recovery And Reduces Muscle Loss.",
            "Limited Processing: Asitis Nutrition Whey Protein Powder Has Been Minimally Processed To Ensure You Get Maximum Protein And Nutrients, As Preserved In Their Original Form. You Get Only Clean And Pure Powder, Without Any Fillers Or Preservatives.",
            "High Protein Concentrate: Each Serving Of 30G Contains 24G Protein And 5.4G Bcaa, Which Makes It Very Effective For Muscle Gain And Synthesis",
            "As Whey Protein Concentrate is unflavoured in nature, it may not taste great. However, it gives you the freedom to add the flavor of your choice."
        ],
        "Availibility": "In stock.",
        "CustomerReviews": "4.0"
    },
    {
        "ProductUrl": "https://www.amazon.in/dp/B01FXI3HDA/",
        "ProductName": "Optimum Nutrition (ON) 100% Whey Protein Powder - 1.85 lbs, 837 g (Chocolate Milkshake)",
        "Price": "1,100.00",
        "ProductFeatures": [
            "100 percent of protein from whey",
            "A complete protein derived from cow’s milk, It regulates and improves the metabolism of your body",
            "Ultra filtered and easy-to-mix powder from world's number 1 seller of protein",
            "Contains 22 grams of whey protein with just 1 gram of sugar and 1 gram of fat",
            "ON Whey is a great addition to your healthy, balanced diet, When To Use: Anytime And Post-Workout",
            "Note: Since the product in packaged in India, it will not have an importer label",
            "Instantized, easy-to-mix protein powder",
            "Brand Customer Care details: Indiacustomercare@glanbia.com, 011 49594959"
        ],
        "Availibility": "In stock.",
        "CustomerReviews": "3.5"
    },
    {
        "ProductUrl": "https://www.amazon.in/dp/B07SVMNVRH/",
        "ProductName": "Powerus Raw Whey Protein Powder 1Kg | 80% Concentrate Whey | 33 Servings | 24 gm Protein, 5.1 gms BCAA and 4 gms Glutamine Per Serving - Unflavored",
        "Price": "799.00",
        "ProductFeatures": [
            "Powerus raw whey protein is an unflavoured protein supplement with zero sugar content",
            "Contains 24g protein for a highly effective product for muscle gain and synthesis",
            "The regular and optimum use helps to build lean muscle, enhances recovery and reduces muscle loss"
        ],
        "Availibility": "In stock.",
        "CustomerReviews": "3.9"
    },
    {
        "ProductUrl": "https://www.amazon.in/dp/B002EVPVCK/",
        "ProductName": "Ultimate Nutrition Prostar 100% Whey Protein - 5.28 lbs (Chocolate Creme)",
        "Price": "2,999.00",
        "ProductFeatures": [
            "The product is packaged as per Indian FSSAI regulations and the text may slightly differ from the US version, however the product formulation is identical to the US version and can be verified with Ultimate Nutrition",
            "Supports Muscle maintenance, build up and toning of the body",
            "Contains all of the essential and non-essential amino acids"
        ],
        "Availibility": "In stock.",
        "CustomerReviews": "3.3"
    },
    {
        "ProductUrl": "https://www.amazon.in/dp/B07DVQV5B3/",
        "ProductName": "Tuff Up 100% Whey Protein - 1 kg (Chocolate), 22g protein per serving, made from imported whey",
        "Price": "799.00",
        "ProductFeatures": [
            "A premium quality whey protein concentrate and whey protein isolate blend that contains digezyme - the latest in digestive enzyme technology",
            "Whey imported from the USA",
            "Contains 22 gm of Whey protein with the blend of Whey Protein Concentrate and Whey Protein Isolate, with WPI being the key ingredient",
            "Contains 3.88 gm of Glutamic Acid and 5.06 gm of BCAA’s per serving",
            "Packed with vital amino acids Leucine, Isoleucine and Valine which aid in swift muscle recovery during fatigue",
            "Contains digezyme for easy absorption of protein, does not contain sugar",
            "Mixes easily in your shaker and comes with a great taste - ideal for active adults who are looking for lean muscle gains",
            "Product contains a scoop inside",
            "To prepare one serving, add 1 rounded scoop in the shaker cup and add 150-200ml of chilled water. Shake well before consumption. Use first thing in the morning or before/after a strenuous workout session"
        ],
        "Availibility": "In stock.",
        "CustomerReviews": "3.4"
    },
    {
        "ProductUrl": "https://www.amazon.in/dp/B019T0K132/",
        "ProductName": "Optimum Nutrition (ON) Gold Standard 100% Whey Protein Powder - 1 lb (Double Rich Chocolate)",
        "Price": "1,254.00",
        "ProductFeatures": [
            "24 grams of whey protein per serving with whey protein isolates as the primary ingredient and just 1 gram of sugar and 1 gram of fat",
            "5 grams of naturally occurring BCAAs, This superior quality powder has been instantized to mix easily using a shaker cup or just a glass and spoon",
            "Over 4 grams of glutamine and glutamic acid in each serving",
            "Whey protein microfractions from whey protein isolate and ultrafiltered whey protein concentrate",
            "Use first thing in the morning, before/after exercise or after weight training",
            "Optimum Nutrition Gold Standard 100% Whey Protein 1 lb Double Rich Chocolate aids in the development of lean muscle"
        ],
        "Availibility": "In stock.",
        "CustomerReviews": "3.7"
    },
    {
        "ProductUrl": "https://www.amazon.in/dp/B000QSNYGI/",
        "ProductName": "Optimum Nutrition (ON) Gold Standard 100% Whey Protein Powder - 5 lbs, 2.27 kg (Double Rich Chocolate)",
        "Price": "5,774.00",
        "ProductFeatures": [
            "24 grams of whey protein per serving with whey protein isolates as the primary ingredient and just 1 gram of sugar and 1 gram of fat",
            "5 grams of naturally occurring BCAAs and over 4 grams of glutamine and glutamic acid in each serving ; Dietary Preference: No Cholesterol ; Number of Scoops per Container: 27-30 scoops",
            "Whey protein microfractions from whey protein isolate and ultrafiltered whey protein concentrate",
            "Use first thing in the morning, before/after exercise or after weight training",
            "In case of any complaint or query regarding the product, contact the customer care at indiacustomercare@glanbia.com or 011 4959 4959"
        ],
        "Availibility": "In stock.",
        "CustomerReviews": "3.2"
    },
    {
        "ProductUrl": "https://www.amazon.in/dp/B07YNLQCKL/",
        "ProductName": "Bigmuscles Nutrition Crude Isolate 1kg, Whey Protein Isolate with Whey Peptides, 26g Protein, 0g Sugar, 1g Added Leucine, 5.5g BCAA, 4g Glutamine, No Preservatives, Unflavored",
        "Price": "1,099.00",
        "ProductFeatures": [
            "UNIQUE FORMULATION: Crude Isolate is an advanced formulation featuring 26g Protein per serving with Whey Peptides. A new generation of Whey Protein Isolate blend offering superior quality, enhanced functionality, and maximum performance.",
            "OBJECTIVES: Rich source of protein designed for Optimal Recovery, Muscle Build and Muscle Retention. Promote Muscle Building-Gain Lean Muscles Like Never Before. Ideal for an Intense workout as It boosts Recovery and Reduces Muscle Soreness, Zero sugar per serving",
            "100% CLEAN PROTEIN: Manufactured from Protein Sourced from USA, Crude Isolate contains 0g Sugar, No Added Soy, No Preservatives, No Artifical Digestive Enzymes and is 100% Banned Substance Dope Free",
            "MUSCLE BUILDING BLEND: By combining the absolute finest ingredients with a series of highly specialized processing techniques, each serving of Crude Isolate brings 4g Glutamine, 5.5g BCAA's, 1G Added Leucine to provide your body with the extra edge required to take your workout to next level.",
            "UN-FLAVOURED: Delicious creamy and neutral taste. Perfect as an workout shake, to make delicious smoothies or as an addition to your breakfast or in between snack. Un-flavoured Whey Isolate gives you the freedom of consuming it the way you love it.",
            "Added 1g Leucine: Formulation features 1g added leucine, ad leucine has a key role in hormone control, stabilising blood glucose levels, preventing muscle protein breakdown and facilitating muscle protein synthesis",
            "USAGE: Easy to Digest Crude Isolate with great mixability can be consumed before breakfast, pre-workout and post workout. Allergens: Contains Milk"
        ],
        "Availibility": "In stock.",
        "CustomerReviews": "3.6"
    },
    {
        "ProductUrl": "https://www.amazon.in/dp/B081JY4ZRP/",
        "ProductName": "MuscleBlaze Biozyme Whey Protein (1 Kg, Ice Cream Chocolate)",
        "Price": "2,199.00",
        "ProductFeatures": [
            "Comes with Enhanced absorption formula (EAF) that provides 50% higher protein absorption and 60% higher BCAA absorption when compared to other whey proteins",
            "Biozyme Whey Protein by Muscleblaze is India's first clinically tested Whey Protein product which is proven and tested for Indian bodies",
            "Biozyme Whey Protein lowers the stomach discomfort in the consumers due to enhanced protein absorption",
            "The product delivers 25g of protein per 33g serving which is roughly 76% protein content and is powered by a combination of Whey Protein Isolate and Whey Protein Concentrate",
            "The delectable Ice Cream Chocolate flavour ensures the customer gets the best of both the worlds in terms of taste and efficacy"
        ],
        "Availibility": "In stock.",
        "CustomerReviews": "5.0"
    },
    {
        "ProductUrl": "https://www.amazon.in/dp/B0791H11NF/",
        "ProductName": "MuscleBlaze Beginner's Whey Protein Supplement (Chocolate, 1Kg)",
        "Price": "1,044.00",
        "ProductFeatures": [
            "12.0g of protein in 30g of serving (40%* of the serving) with Zero added sugar",
            "Whey Protein Concentrate is the primary source of protein in the product.",
            "5.5g of EAAs along with 2.6g of BCAA’s help keep the body in anabolic state and muscle gains post workout.",
            "The product is free from any banned substance or doping ingredients as per NADA/WADA list."
        ],
        "Availibility": "In stock.",
        "CustomerReviews": "3.9"
    },
    {
        "ProductUrl": "https://www.amazon.in/dp/B01EVANQRS/",
        "ProductName": "MuscleBlaze Whey Energy, 1 kg / 2.2 lb Chocolate",
        "Price": "1,299.00",
        "ProductFeatures": [
            "Superior blend of 20g fast-absorbing whey proteins & vitamin/minerals per serving stimulate quick muscle recovery",
            "4.56g BCAAs in each serving improves fatigue threshold and enhances recovery",
            "Fortified with 13 vitamins and 5 minerals which boost recovery and optimize energy levels",
            "Added goodness of Medium Chain Triglycerides contribute to better fat metabolism",
            "Ideal muscle recovery booster for beginner body builders and fitness enthusiasts"
        ],
        "Availibility": "In stock.",
        "CustomerReviews": "4.0"
    },
    {
        "ProductUrl": "https://www.amazon.in/dp/B072KV29DP/",
        "ProductName": "Sinew Nutrition Instantised Raw & Real Whey Protein Concentrate 79% - 1 Kg (Unflavoured)",
        "Price": "999.00",
        "ProductFeatures": [
            "EXCEPTIONAL PROTEIN PROFILE: Each 30 gm serving of Sinew Nutrition Instantized Whey Protein Concentrate provides premium quality and high performance protein with 23.7gm protein, 5gm BCAA and 4gm glutamine.",
            "MINIMALLY PROCESSED: Each serving of 30 gm of denatured whey protein is minimally processed, preserving the delicate nutrients found in natural whey protein powder. It contains no artificial sweetners, banned substances or flavors and is Gluten-free and Non-GMO.",
            "HIGH BIOLOGICAL VALUE PROTEIN: Made from superior American WHEY PROTEIN, this unflavoured protein powder digests faster and has higher biologically active components making it's utilization in the body of the athlete efficient. It's unparalled amino acid profile makes it readily available for the activation of muscle protein synthesis and countering the catabolic effects.",
            "ULTIMATE MUSCLE FUEL: A great amino profile makes it ideal to be used as a pre-workout and also as a post workout recovery drink supporting muscle protein synthesis. Low fat and carb content makes it ideal for the fitness freaks.",
            "EASY TO USE: This versatile protein can be easily added to one's diet in any form. One can add varying types of flavours and easily whip up smoothies, shakes, cookies or nutritional bars for a protein boost.",
            "CAUTION: This product contains milk and dairy derivatives, hence is not suitable for people with lactose intolerance. People with medical conditions should consult the doctor before taking this whey protein. In case of any discomfort, discontinue use & seek physician’s help."
        ],
        "Availibility": "In stock.",
        "CustomerReviews": "4.3"
    },
    {
        "ProductUrl": "https://www.amazon.in/dp/B07N6P2YZM/",
        "ProductName": "Tuff Up Raw Whey Protein Concentrate 80% (Unflavoured – 1 kg/2.2 lb)",
        "Price": "749.00",
        "ProductFeatures": [
            "Flexibility -Tuff Up raw whey is unflavoured and unsweetened in nature; It provides flexibility of Usage and freedom to add any flavours or make any recipe out of whey protein",
            "Use it to prepare your own protein dish – pancakes, bars, ice-creams, smoothies",
            "Zero Aspartame, Zero added sugar, No added flavours, Vegetarian source of protein",
            "5.2g of BCAAs to help with fast muscle synthesis",
            "Every product comes with a unique authenticity code using which the customer can confirm the genuineness of the product"
        ],
        "Availibility": "In stock.",
        "CustomerReviews": "3.9"
    },
    {
        "ProductUrl": "https://www.amazon.in/dp/B0776RZGH9/",
        "ProductName": "DREXSPORT - Wild Whey - Organic, Grass-fed Whey Protein Powder for Men and Women - Isolate + Concentrate - 2Kg Chocolate",
        "Price": "4,499.00",
        "ProductFeatures": [
            "SUPERB: TASTE AND RESULTS - Wild Whey is a results-driven formula made with world-class ingredients. It does not have a bitter or bad taste, it mixes easily, doesn't foam, smells pleasant, and tastes like a delicious chocolate shake. Wild Whey is a blend of organic, grass-fed whey protein isolate and concentrate. Wild Whey benefits - build and maintain lean muscle, a key in weight loss, good for skin-hair-bones, it boosts immunity, increases energy, and much more. Suitable for men and women.",
            "ZERO ARTIFICIAL INGREDIENTS - We add zero highly processed or denatured whey protein, zero artificial sweeteners (aspartame, sucralose, acesulfame, or potassium), zero artificial flavors, zero artificial colors, zero preservatives, zero thickeners (gum or xanthan gum), zero synthetic multivitamins, zero GMO (soy lecithin), zero chemicals, zero banned substances, and strictly zero low-standard ingredients. Wild Whey is 100% natural and does not contain any dangerous or unhealthy ingredient.",
            "SOLVES PROBLEM OF MOST RAW WHEY PROTEIN - Most raw whey protein supplements are low-standard, denatured and highly processed whey protein, that are not easy to mix, hard to digest, foam a lot, have a low bioavailability, are poor tasting, adulterated (soy, milk, wheat, corn, or chemical powder added), have no digestive enzymes, provide no results and might be unhealthy option. This Wild Whey gives you the opposite: real results, delicious taste and the best shake-making experience possible.",
            "AUTHENTICATION - DREXSPORT is an amazon registered brand, sells its own products on amazon with no third party sellers. You always get our product straight from our warehouse. A hologram on the label & another hologram on the seal cap, which breaks after opening the cap, verifies authenticity. We also wrap 1kg and 2kg product box in our branded tape to ensure authenticity. We have taken all necessary, advanced steps to fight counterfeit products. Be confident, you always get genuine products.",
            "DREXSPORT BRAND – Is a trusted protein brand that customers worldwide are likely to recommend, Wild Whey - All natural whey protein supplement (patent filed, lab-tested, regd., licensed & certified: FDA, FSSAI, GMP). Amazon awarded Drexsport for outstanding performance. There is no other organic whey protein powder on the market like Wild Whey, and no company can legally make a similar product or even manipulate our product. We promise to manufacture genuine products & be honest in business."
        ],
        "Availibility": "In stock.",
        "CustomerReviews": "4.6"
    },
    {
        "ProductUrl": "https://www.amazon.in/dp/B07Q6Z2DVC/",
        "ProductName": "Labrada ISO WHEY 100% Whey Protein Isolate (Post Workout, 25g Protein, 0g Sugar,0 Fat,Gluten Free, Lactose Free, 66 Servings) - 4.4 lbs (2kg) (Chocolate)",
        "Price": "4,843.00",
        "ProductFeatures": [
            "Provides high strength.",
            "Helps in musclebuilding",
            "Has the highest protein."
        ],
        "Availibility": "In stock.",
        "CustomerReviews": "3.9"
    },
    {
        "ProductUrl": "https://www.amazon.in/dp/B07K7SV1QH/",
        "ProductName": "Labrada 100% Whey Protein Concentrate (26g Protein, 0g Sugar, 13 Servings) - 1.1 lbs (500g) (Chocolate)",
        "Price": "1,039.00",
        "ProductFeatures": [
            "26g Protein & 3.7g Carbohydrate with 0g sugar added to the product",
            "Perfect for athletes, fitness enthusiasts, bodybuilders, and dieters who want to supplement their nutrition with the highest-quality protein",
            "It is made using instantized whey protein concentrate, an excellent source of all the amino acids, including branched- chain amino acids and glutamine, which provide support for muscle tissue, and recovery from exercise",
            "Mixes easily with water, juice or milk. Use it to boost your protein intake at meals, or in-between meals as a snack"
        ],
        "Availibility": "In stock.",
        "CustomerReviews": "3.7"
    },
    {
        "ProductUrl": "https://www.amazon.in/dp/B07YX4VLC2/",
        "ProductName": "NAKPRO Perform Whey Protein Concentrate with Added Digestive Enzymes, Raw Whey Protein 1kg Supplement Powder - Unflavoured",
        "Price": "799.00",
        "ProductFeatures": [
            "Nakpro Perform Raw Whey Protein Concentrate Imported from USA, 24g Protein in 33g serve size with 5.7g of BCAA and 12.7g of EAAs and Glutamic Acid 4.7g",
            "All Natural : No Artificial Colour, flavour, additives, fillers. Zero Sugar and No Banned Substances & Chemicals.",
            "Builds Muscle Mass: Nakpro Perform Whey Protein Concentrate is Rich Source of Protein which helps to build lean muscle, enhances recovery, supports healthy metabolism and reduces muscle loss. bullet-point",
            "UNFLAVORED (Raw and Asitis) Whey protein concentrate best suited for any kind of shakes or drinks having instantly soluble ability and Pure VEGETARIAN Whey Protein.",
            "Readily dissolves in water or milk, No lumping or residue. Customers should mix 1 scoop (33g) in 180-200 ml water for best results."
        ],
        "Availibility": "In stock.",
        "CustomerReviews": "3.8"
    },
    {
        "ProductUrl": "https://www.amazon.in/dp/B0721745M1/",
        "ProductName": "MuscleBlaze Whey Gold 100% Whey Protein Isolate with Digezyme (Rich Milk Chocolate, 1 kg / 2.2 lb)",
        "Price": "2,179.00",
        "ProductFeatures": [
            "Muscleblaze whey gold is manufactured using whey from united states and delivers 25g of protein per 30g serving",
            "Whey isolate with the highest pdcaa(protein digestibility corrected amino acid) score of 1, the only source in whey gold ensures the highest quality of protein is available to the customer for consumption",
            "Guaranteed protein certificate from a 3rd party lab (nabl accredited) makes it the most authentic product available in the market",
            "With 5.5g bcaa, 1.65g carb and 0.46g fat per serving, this is the most impeccable protein powder supplement available",
            "Customers should mix 1 scoop (30g) in 180-200 ml water for best results"
        ],
        "Availibility": "In stock.",
        "CustomerReviews": "3.8"
    },
    {
        "ProductUrl": "https://www.amazon.in/dp/B07Y8DN3MX/",
        "ProductName": "The Protein Zone Original Whey | 80% Raw Whey | 33 Servings | 24 gm Protein, 5.29 gm BCAA and 4.21 gm Glutamine Per Serving (Unflavored, 1Kg)",
        "Price": "999.00",
        "ProductFeatures": [
            "TPZ Original Whey, is an 80% raw Whey Protein concentrate product which helps in muscle growth and maintenance for fitness enthusiasts",
            "Original Whey delivers whey in its most natural form, which is free from any additive, preservative, flavour, sweetener or any other external ingredient",
            "Each 30g serving of Original Whey delivers 24g of protein along with nearly 5.3g of BCAAs which promotes recovery post workout and helps build muscle mass",
            "Original Whey’s ingredient is sourced from USA and it follows a 3rd party protein testing protocol. The protein certificates for each batch and the authenticity of the product can be verified by the customer",
            "Original Whey is an unflavoured product and thus might not taste great but has the greatest flavour flexibility. It can be used with any flavouring or in any shake being prepared as per the taste profile of the customer"
        ],
        "Availibility": "In stock.",
        "CustomerReviews": "4.4"
    },
    {
        "ProductUrl": "https://www.amazon.in/dp/B071KWBBXZ/",
        "ProductName": "MuscleBlaze Whey Gold 100% Whey Protein Isolate (Rich Milk Chocolate, 2 kg / 4.4 lb)",
        "Price": "4,479.00",
        "ProductFeatures": [
            "Muscleblaze whey gold is manufactured using whey from united states and delivers 25g of protein per 30g serving",
            "Whey isolate with the highest pdcaa(protein digestibility corrected amino acid) score of 1, the only source in whey gold ensures the highest quality of protein is available to the customer for consumption",
            "Guaranteed protein certificate from a 3rd party lab (nabl accredited) makes it the most authentic product available in the market",
            "With 5.5g bcaa, 1.65g carb and 0.46g fat per serving, this is the most impeccable protein powder supplement available",
            "Customers should mix 1 scoop (30g) in 180-200 ml water for best results"
        ],
        "Availibility": "In stock.",
        "CustomerReviews": "3.8"
    },
    {
        "ProductUrl": "https://www.amazon.in/dp/B00GWM3GSI/",
        "ProductName": "Muscleblaze 100% Whey Protein Supplement Powder - 2 kg, 60 servings (Rich Milk Chocolate)",
        "Price": "3,599.00",
        "ProductFeatures": [
            "MuscleBlaze Whey Protein with 25g protein and 5.5g BCAA per serving makes it the best Whey protein Supplement powder",
            "MuscleBlaze Whey Protein is manufactured using Whey from United States of America ensuring protein quality of international standards",
            "Whey protein Isolate, the major ingredient also considered the most superior form of protein is the primary source of protein with Whey protein concentrate as the secondary source",
            "It comes with added digestive enzymes which help with faster and easier digestion of protein in 4 different flavours namely Rich Milk Chocolate, Cafe Mocha, Vanilla & Strawberry.",
            "Consumers aiming for muscle gain should mix 1 scoop (32g) in 180-200 ml water and take 1-2 shakes per day."
        ],
        "Availibility": "In stock.",
        "CustomerReviews": "3.9"
    },
    {
        "ProductUrl": "https://www.amazon.in/dp/B07Y1YF9RL/",
        "ProductName": "Bigmuscles Nutrition Raw & Real Organic Whey Protein [1kg] with Shaker Bottle [400 ml] - Natural, 80% Protein, Additive Free, Unflavored, 24g Protein,5.5g BCAA, 4g Glutamine per serving",
        "Price": "1,139.00",
        "ProductFeatures": [
            "High in protein (80%) for Optimal Recovery, Muscle Build and Muscle Retention. Dissolves perfectly in water and any other liquid. Promotes Muscle Building: Gain Lean Muscles Like Never Before. In Its Organic Natural, Raw Form, Raw and Real Whey Protein Is Ideal for An Intense Workout as It Boosts Recovery and Reduces Muscle Soreness.",
            "100% Pure Organic Whey protein powder from Happy Grass Fed Cows which provide 24g protein, 5.5g BCAA and 4g Glutamine per 30g serving",
            "Hormone free, GMO free, Soy free, no Artificial Additives, no Added Sugars or other Sweeteners",
            "Only 1 Ingredient: Organic Whey Protein Concentrate from USA. This food supplement contains a complete Amino Acid profile (BCAA's). Allergens: contains lactose",
            "Delicious creamy and neutral taste. Perfect as an after workout shake, to make delicious smoothies or as an addition to your breakfast or in between snack."
        ],
        "Availibility": "In stock.",
        "CustomerReviews": "3.8"
    },
    {
        "ProductUrl": "https://www.amazon.in/dp/B07YX4VLC2/",
        "ProductName": "NAKPRO Perform Whey Protein Concentrate with Added Digestive Enzymes, Raw Whey Protein 1kg Supplement Powder - Unflavoured",
        "Price": "799.00",
        "ProductFeatures": [
            "Nakpro Perform Raw Whey Protein Concentrate Imported from USA, 24g Protein in 33g serve size with 5.7g of BCAA and 12.7g of EAAs and Glutamic Acid 4.7g",
            "All Natural : No Artificial Colour, flavour, additives, fillers. Zero Sugar and No Banned Substances & Chemicals.",
            "Builds Muscle Mass: Nakpro Perform Whey Protein Concentrate is Rich Source of Protein which helps to build lean muscle, enhances recovery, supports healthy metabolism and reduces muscle loss. bullet-point",
            "UNFLAVORED (Raw and Asitis) Whey protein concentrate best suited for any kind of shakes or drinks having instantly soluble ability and Pure VEGETARIAN Whey Protein.",
            "Readily dissolves in water or milk, No lumping or residue. Customers should mix 1 scoop (33g) in 180-200 ml water for best results."
        ],
        "Availibility": "In stock.",
        "CustomerReviews": "3.8"
    },
    {
        "ProductUrl": "https://www.amazon.in/dp/B07XJXYWRG/",
        "ProductName": "Six Pack Nutrition Raw Whey Protein Powder Unflavoured Whey Protein Concentrate 80% -24 g Protein, 5.4 g BCAA,4 g Glutamic Acid 907 g/2lbs",
        "Price": "779.00",
        "ProductFeatures": [
            "Six Pack Nutrition Raw Whey Protein is whey in its purest form, as it is",
            "It is an instantised unflavoured whey protein concentrate with 80% protein content and provides 40% RDA of protein in a single serving",
            "Six Pack Nutrition sources its whey protein from Glanbia Nutritionals, USA",
            "Raw Whey is naturally gluten free and also free of any banned substances, additives, flavours, sweeteners, sugars or preservatives",
            "The neutral taste of Six Pack Nutrition’s Raw Whey gives you the flexibility to add into any food or beverage of your choice .Each serving contains 24 g protein, 10.9 g EAA including 5.4 g BCAA and 4 g glutamic acid"
        ],
        "Availibility": "In stock.",
        "CustomerReviews": "4.0"
    },
    {
        "ProductUrl": "https://www.amazon.in/dp/B06XZK88LT/",
        "ProductName": "Sinew Nutrition Instantised Raw & Real Whey Protein Concentrate 79% - 840 g (Unflavoured)",
        "Price": "849.00",
        "ProductFeatures": [
            "EXCEPTIONAL PROTEIN PROFILE: Each 30 gm serving of Sinew Nutrition Instantized Whey Protein Concentrate provides premium quality and high performance protein with 23.7gm protein, 5gm BCAA and 4gm glutamine.",
            "MINIMALLY PROCESSED: Each serving of 30 gm of denatured whey protein is minimally processed, preserving the delicate nutrients found in natural whey protein powder. It contains no artificial sweetners, banned substances or flavors and is Gluten-free and Non-GMO.",
            "HIGH BIOLOGICAL VALUE PROTEIN: Made from superior American WHEY PROTEIN, this unflavoured protein powder digests faster and has higher biologically active components making it's utilization in the body of the athlete efficient. It's unparalled amino acid profile makes it readily available for the activation of muscle protein synthesis and countering the catabolic effects.",
            "ULTIMATE MUSCLE FUEL: A great amino profile makes it ideal to be used as a pre-workout and also as a post workout recovery drink supporting muscle protein synthesis. Low fat and carb content makes it ideal for the fitness freaks.",
            "EASY TO USE: This versatile protein can be easily added to one's diet in any form. One can add varying types of flavours and easily whip up smoothies, shakes, cookies or nutritional bars for a protein boost.",
            "CAUTION: This product contains milk and dairy derivatives, hence is not suitable for people with lactose intolerance. People with medical conditions should consult the doctor before taking this whey protein. In case of any discomfort, discontinue use & seek physician’s help."
        ],
        "Availibility": "In stock.",
        "CustomerReviews": "4.2"
    },
    {
        "ProductUrl": "https://www.amazon.in/dp/B07BTRS4QV/",
        "ProductName": "MyFitFuel MFF Whey Protein 80 | 1 Kg, 30 Servings (Café Mocha)",
        "Price": "1,349.00",
        "ProductFeatures": [
            "New Packing of 1 Kg (2.2 lbs) at same old approx. 900gm (2 lbs) price. Almost approx. 100 gm Extra protein",
            "26.4 gm (Dry basis) and 24.3 gm (As is basis) of imported protein in every 32.8 gm serving in Unflavored Variant. 24.5 gm (Dry basis) and 23 gm (As is basis) of imported protein in every 32.8 gm serving in Café Mocha Flavor. 23.5 gm (Dry basis) and 21.7 gm (As is basis) of imported protein in every 32.8 gm serving in Rich Chocolate Delight Flavor. For Nutrition details of other flavor variants of MFF Whey Protein 80, please check their nutrition charts.",
            "2.2 lbs (1 Kg) comes with 30 Total Servings. MyFitFuel trusted by 50,000+ happy customers. You can authenticate every MyFitFuel Product through SMS or on our website through given scratch code on product.",
            "Provides naturally occurring upto 5.2 gm BCAA & 3.8 gm Glutamine rich, 11.2 gm Essential Amino acids in every serving. Low in fat & carbohydrate. Ultra-pure Lab tested protein & ideal for lean growth. Complete transparency, you can check Protein Report about which protein used on MFF Whey Protein 80 product page on MyFitFuel website. No Soy Protein, No Dairy Whiteners, No Skim Milk Powder No Sugar, No Color, No Artificial Flavor or Preservatives added.",
            "First in India in year 2013 to bring knowledge on 100% Transparency including information on cheap fillers, thickeners and now in year 2017 we are first in India to bring better education on knowledge of “Dry basis” Protein vs “As is basis” protein in Fitness Nutrition Industry."
        ],
        "Availibility": "In stock.",
        "CustomerReviews": "4.1"
    },
    {
        "ProductUrl": "https://www.amazon.in/dp/B07DVMN4Z5/",
        "ProductName": "Tuff Up Whey Plus Protein - 2 kg (Chocolate), 24g protein per serving, made from imported whey",
        "Price": "2,019.00",
        "ProductFeatures": [
            "Contains superior quality whey protein isolate and comes with enhanced functionality for maximum performance",
            "Whey imported from the USA",
            "Boasts of 24g of high quality protein per serving, making it the perfect choice for achieving all your training goals",
            "Each serving contains 5.98 gm of BCAA’s and 4.35 gm of Glutamic Acid",
            "Packed with indispensable amino acids Leucine, Isoleucine and Valine which aid in swift muscle recovery during fatigue",
            "Contains digezyme for easy absorption of protein, does not contain sugar",
            "Aids in the growth and maintenance of muscle mass, while also being low in fat content - the ideal choice for those who are also worried about calories",
            "Product contains a scoop inside",
            "To prepare one serving, add 1 rounded scoop in the shaker cup and add 150-200ml of chilled water. Shake well before consumption. Use first thing in the morning or before/after a strenuous workout session"
        ],
        "Availibility": "In stock.",
        "CustomerReviews": "3.0"
    },
    {
        "ProductUrl": "https://www.amazon.in/dp/B07665NMYQ/",
        "ProductName": "Muscletech Performance Series Nitrotech Whey Gold (Whey Protein Peptides & Isolate, 24g Protein, 5.5g BCAAs, 4g Glutamine, Gluten Free, Post-Workout) - 8lbs (3.63kg) (Double Rich Chocolate)",
        "Price": "6,510.00",
        "ProductFeatures": [
            "Superior protein for better muscle building",
            "100 Percent whey- no added active ingredients",
            "Cold filtered, multi-phase filtration reduces fat, lactose and impurities without using heat, harsh acids or salt",
            "Nitrotech Whey Gold is coming with International packing as well as Importer Specified packing. You may receive stock of both version",
            "When to take : The best time is before and after exercise , you can also drink it between meals to support your overall protein intake"
        ],
        "Availibility": "In stock.",
        "CustomerReviews": "3.3"
    },
    {
        "ProductUrl": "https://www.amazon.in/dp/B07Y9RT9D7/",
        "ProductName": "NUTRABOX Protein Plus Post Workout Gym Supplement with No Added Sugar/Body Building Powder for Beginners & Intermediates - 1 kg Cafe Latte Flavor",
        "Price": "699.00",
        "ProductFeatures": [
            "NUTRABOX Protein Plus has a protein rich profile that helps build muscle mass at the beginner’s to Intermediate level",
            "Consists of fast, slow and steady digesting protein sources that allow you to fit into the proper process of supplementation",
            "Contains 36 grams of Protein per 100 grams",
            "100% biological values, it gives all Essential & Branched chain amino acids (BCAA) helps in building good muscle & maintain overall well-being of the body",
            "Genuine & Cost Effective - NUTRABOX products are sold directly from the Brand. That makes it inexpensive and you get genuine products every time you place an order"
        ],
        "Availibility": "In stock.",
        "CustomerReviews": "4.1"
    },
    {
        "ProductUrl": "https://www.amazon.in/dp/B07L5LR3QK/",
        "ProductName": "Arms Nutrition Natural Series Davisco Whey Protein Concentrate 2kg with Digestive Enzymes, Unflavoured (65+ Servings)",
        "Price": "1,714.00",
        "ProductFeatures": [
            "Zero sugar and natural flavor",
            "Natural whey is fortified with multiple enzymes (bromelain and papien) which helps in 100 percent absorption of the consumed protein and yields best results",
            "Purest form of whey protein concentrate",
            "66 Servings of 30g each",
            "Natural series whey protein is manufactured using whey from the USA and delivers 24gm of protein per 30g serving"
        ],
        "Availibility": "In stock.",
        "CustomerReviews": "4.1"
    },
    {
        "ProductUrl": "https://www.amazon.in/dp/B07PHCVRTJ/",
        "ProductName": "HealthOxide My First Protein with whey, casein & pea, Chocolate – 1 kg",
        "Price": "590.00",
        "ProductFeatures": [
            "HealthOxide My First Protein is a blend of four high-quality proteins including Whey, Soy, Casein and Pea which help provide a sustained release of protein for long hours.",
            "Each serving provides 9.9g of protein to maintain good muscle health",
            "Contains naturally occurring Essential Amino Acids (EAAs), Conditionally Essential Amino Acids (CAAs) and Nonessential Amino Acids (NAAs) minimize muscle fatigue and muscle loss.",
            "Contains No Added Sugar and is 100% Gluten free.",
            "Enriched by 26 vitamins and minerals with total 30 nutrients combination for stronger and healthier energy."
        ],
        "Availibility": "In stock.",
        "CustomerReviews": "3.6"
    },
    {
        "ProductUrl": "https://www.amazon.in/dp/B00R60EUTE/",
        "ProductName": "Labrada 100% Whey Protein - 4.13 lbs (1875 g) (Chocolate)",
        "Price": "3,239.00",
        "ProductFeatures": [
            "Having 24g of protein",
            "Gluten free",
            "Perfect for athletes, bodybuilders, and fitness enthusiasts who demand the purest, highest quality protein available in the market Ideal for muscular recovery and growth"
        ],
        "Availibility": "In stock.",
        "CustomerReviews": "3.7"
    },
    {
        "ProductUrl": "https://www.amazon.in/dp/B07NYDV89G/",
        "ProductName": "Abbzorb Nutrition Whey Protein; 1 kg (Chocolate Flavour) (1 Kg Jar)",
        "Price": null,
        "ProductFeatures": [],
        "Availibility": "In stock.",
        "CustomerReviews": "4.3"
    },
    {
        "ProductUrl": "https://www.amazon.in/dp/B081H7DH35/",
        "ProductName": "Himalaya Quista Pro Advanced Whey Protein Powder Travel Pack - 7 X 34 g (Chocolate)",
        "Price": "700.00",
        "ProductFeatures": [
            "Quista pro contains 3 whey protein blend, concentrate, isolate and hydrolysate for faster absorption",
            "Fortified with peptides and taurine which minimize post injury workout and hasten recovery",
            "Quista pro is enriched with herbal actives which develops bone health, build stamina and endurance",
            "Fortified with calcium and vitamins for better bone health",
            "Enriched with bcaa which improves exercise performance"
        ],
        "Availibility": "In stock.",
        "CustomerReviews": null
    },
    {
        "ProductUrl": "https://www.amazon.in/dp/B00CUDYY2U/",
        "ProductName": "Dymatize Nutrition Elite 100% Whey Protein - 2. 3 kg (Rich Chocolate)",
        "Price": "4,820.00",
        "ProductFeatures": [
            "100 percent whey protein concentrate and whey protein Isolate",
            "Provides ideal ratio of essential and non-essential amino acids in their most easily assimilated form",
            "29 grams of protein per serving, 3. 5 grams of glutamine and glutamine precursors, 5 grams of BCAAs, low in carbs and aspartame free",
            "Notice: Use this product as a Food Supplement only. Do not use for weight reduction"
        ],
        "Availibility": "In stock.",
        "CustomerReviews": "3.8"
    },
    {
        "ProductUrl": "https://www.amazon.in/dp/B002U7YZXY/",
        "ProductName": "Isopure Zero Carb 100% Whey Protein Isolate Powder - 1 lb, 454 g (Creamy Vanilla)",
        "Price": "1,499.00",
        "ProductFeatures": [
            "25 grams of protein per serving, 0 carbs and sugars",
            "100 percent whey protein isolate",
            "Gluten free, lactose free and aspartame free",
            "Glutamine enriched loaded with BCAAs",
            "For any queries, please contact_us on: [011 49594959]"
        ],
        "Availibility": "In stock.",
        "CustomerReviews": "3.1"
    },
    {
        "ProductUrl": "https://www.amazon.in/dp/B0825QCGHT/",
        "ProductName": "PROCEL® KETOWHEY® Keto Whey Isolate Protein Powder with Ketofuel - Trial Pack 200g (Mango Lassi)",
        "Price": "499.00",
        "ProductFeatures": [
            "The industry’s first keto protein powder, custom designed to support a nutritionally keto-adapted state. Supports varied LCHF protocols from ketogenic to paleo diets",
            "Powered by the patent pending KETOFUEL Zero-Carb fat blend of MCTs and Coconut Oil. Whey Isolates – Only source",
            "1:1 calorific ratio of Fat:Protein to support varied LCHF diets from Ketogenic or Paleo to Gluconeogenic diets. 25g All-Whey-Isolate protein and 12.2g Ketofuel Fat Complex per serving.",
            "While MCTs help in fat metabolism and mental clarity, Coconut oil helps reduce cellular inflammation and stimulates fat burning.",
            "PROCEL standard full transparency label including “Total Sugars” and not just “Added Sugar” (added sugar is table sugar). No Artificial colors or flavors in line with the PROCEL brand philosophy. Sweetened with Stevia."
        ],
        "Availibility": "In stock.",
        "CustomerReviews": "3.5"
    },
    {
        "ProductUrl": "https://www.amazon.in/dp/B07K1288BH/",
        "ProductName": "MuscleXP Raw Whey Protein Concentrate 80% Powder With Digestive Enzymes, Unflavored, 1Kg (2.2lb)",
        "Price": "1,299.00",
        "ProductFeatures": [
            "PERFORMANCE NUTRITION: Each scoop of our MuscleXP Raw Whey Protein has 24g Protein with no added sugars. Customers choose Levels for a clean way to build lean muscle, enhance fitness and improve their overall health.",
            "USA Imported Raw Whey Protein - MuscleXP Raw Whey Protein is Imported from US and Packed in India meeting the highest quality standards. Our whey is gluten free, soy free, antibiotic free, and contains no artificial flavors, no so-called \"natural flavors”, no artificial sweeteners and no GMOs.",
            "Whey is so effective because it provides a more absorbable source of protein than any other type of food or supplement, and it’s easy to digest. No wonder it has become one of the most popular protein supplements on the market today.",
            "To use whey protein, simply add one scoop of a high-quality powder to any shake or smoothie, protein shakes is an easy and portable way to increase your daily protein consumption, build muscle mass and boost your immune system.",
            "4g of L-Glutamine and Over 5.15g of naturally occurring BCAAs per serving with a complete amino acid profile. 80g Pure Whey Protein per 100g Serving."
        ],
        "Availibility": "In stock.",
        "CustomerReviews": "4.1"
    },
    {
        "ProductUrl": "https://www.amazon.in/dp/B00LLZ9FOA/",
        "ProductName": "MuscleBlaze Whey Active Protein Supplement Powder (Chocolate, 2 kg / 4.4 lb, 60 Servings)",
        "Price": "2,589.00",
        "ProductFeatures": [
            "MuscleBlaze Whey active is a 60% protein supplement powder with 20g protein per serving (33g)",
            "It is manufactured using Whey imported from united States of America ensuring international quality protein",
            "Each serving comes with 4.3g of BCAA and 3.5g of Glutamic acid powering the muscle synthesis and recovery process for the gym goer",
            "It comes in Chocolate flavour and maintains a positive nitrogen balance to reduce muscle breakdown",
            "Consume 1 scoop (33g) of the product in 180-210 ml of water and take 1-2 shakes daily for great results"
        ],
        "Availibility": "In stock.",
        "CustomerReviews": "3.8"
    },
    {
        "ProductUrl": "https://www.amazon.in/dp/B07L5NB4DY/",
        "ProductName": "Sinew Nutrition Beginner's Intense Whey Protein Supplement with Digestive Enzymes, 300gm, Chocolate",
        "Price": "299.00",
        "ProductFeatures": [
            "Best Workout Protein Supplement: Sinew nutrition intense whey protein supplement has digestive enzymes which is beneficial for achieving healthy body. The best protein for beginners to get the desired results.",
            "Key Ingredients: Sinew Nutrition has key ingredients like Protein, BCAA and Glutamine. All these compounds are known for enhancing the beginner’s performance, strength and stamina.",
            "Instant Workout Supplement: With our Sinew Nutrition Intense Whey Protein, you can have a drink made instantly by just using the mix with water.",
            "Available Flavours: Our Sinew Nutrition intense whey protein comes in a variety of flavours such as Coffee, Kesar Badam Pista, Vanilla, Strawberry, Butterscotch, Banana from which you can choose as per your taste.",
            "Enhanced Performance: With our intense whey protein supplement, you can have an intense workout as well as help in a speedy muscle recovery."
        ],
        "Availibility": "In stock.",
        "CustomerReviews": "4.2"
    },
    {
        "ProductUrl": "https://www.amazon.in/dp/B07H7KT8JT/",
        "ProductName": "HealthKart 100% Pure Raw Whey Protein Concentrate, 1 Kg/2.2 lb (Unflavoured)",
        "Price": "1,099.00",
        "ProductFeatures": [
            "HealthKart 100% Pure Whey Protein provides 24g of natural pure whey protein for each serving (30g) specially formulated for weight training athletes and active fitness enthusiasts",
            "It is formulated to fuel your muscles with 11.28g of EAAs, 5.29g of BCAAs, and 3.65g of SEAAs which help provide vital amino acids to the muscles for efficient muscle synthesis",
            "Each serving provides 4.21g of Glutamic Acid which helps enhance the production of nitric oxide in the body and promotes endurance for intense workouts",
            "With Zero Added Sugar, this whey protein is unsweetened and unflavored for the calorie conscious",
            "Manufactured in a HACCP certified facility, this whey protein is completely free from any added preservatives, heavy metals, and gluten"
        ],
        "Availibility": "In stock.",
        "CustomerReviews": "3.6"
    },
    {
        "ProductUrl": "https://www.amazon.in/dp/B07DZZYNMJ/",
        "ProductName": "MuscleBlaze Whey Protein Performance (1 Kg / 2.2 lb, Chocolate), 25 gm protein, 5.5 gm BCAA, 4,4 gm Glutamic Acid, with added vitamins",
        "Price": "1,299.00",
        "ProductFeatures": [
            "25.20g of protein in 36g of serving with Zero added sugar and Zero Trans Fats.",
            "Whey Performance is for core bodybuilders and athletes targeting muscle gain with Whey Protein Concentrate and Whey Protein Isolate being the quality source of protein of Whey Performance.",
            "Added vitamins to fulfill your micro-nutrients need.",
            "Every unit of the product will have an NABL accredited lab report against the product which can be accessed on muscleblaze website. The customer can check the amount and source of protein using the batch number of his/her Product.",
            "Peace of mind for customers through NABL accredited lab report for every consumer to test out the quantity & quality of protein."
        ],
        "Availibility": "In stock.",
        "CustomerReviews": "3.9"
    },
    {
        "ProductUrl": "https://www.amazon.in/dp/B07G4BNWDK/",
        "ProductName": "Advance Musclemass 100% Raw Whey Protein Supplement Powder (Unflavoured) 1 Kg 2.2 Lb (33 Servings)",
        "Price": "1,039.00",
        "ProductFeatures": [
            "HIGH PROTEIN : Advance MuscleMass Raw Whey Protein with 24.2 g protein and 5.2 g BCAA per serving makes it the best Whey protein Supplement powder",
            "WHEY FROM USA : Advance MuscleMass Raw Whey Protein is manufactured using Whey from United States of America ensuring protein quality of international standards",
            "MUSCLE FUEL : Good for Muscle gain, Lean body and Endurance",
            "USAGE : Consumers aiming for muscle gain should mix 1 scoop (30g) in 180-200 ml water and take 1-2 shakes per day.",
            "GOLD STANDARD : As it is from the manufacturer, no preservative no additive no flavor added"
        ],
        "Availibility": "In stock.",
        "CustomerReviews": "4.3"
    },
    {
        "ProductUrl": "https://www.amazon.in/dp/B06Y5LS5Y5/",
        "ProductName": "Sinew Nutrition Instantised Raw & Real Whey Protein Concentrate 79% - 360 g (Unflavoured)",
        "Price": "399.00",
        "ProductFeatures": [
            "EXCEPTIONAL PROTEIN PROFILE: Each 30 gm serving of Sinew Nutrition Instantized Whey Protein Concentrate provides premium quality and high performance protein with 23.7gm protein, 5gm BCAA and 4gm glutamine.",
            "MINIMALLY PROCESSED: Each serving of 30 gm of denatured whey protein is minimally processed, preserving the delicate nutrients found in natural whey protein powder. It contains no artificial sweetners, banned substances or flavors and is Gluten-free and Non-GMO.",
            "HIGH BIOLOGICAL VALUE PROTEIN: Made from superior American WHEY PROTEIN, this unflavoured protein powder digests faster and has higher biologically active components making it's utilization in the body of the athlete efficient. It's unparalled amino acid profile makes it readily available for the activation of muscle protein synthesis and countering the catabolic effects.",
            "ULTIMATE MUSCLE FUEL: A great amino profile makes it ideal to be used as a pre-workout and also as a post workout recovery drink supporting muscle protein synthesis. Low fat and carb content makes it ideal for the fitness freaks.",
            "EASY TO USE: This versatile protein can be easily added to one's diet in any form. One can add varying types of flavours and easily whip up smoothies, shakes, cookies or nutritional bars for a protein boost.",
            "CAUTION: This product contains milk and dairy derivatives, hence is not suitable for people with lactose intolerance. People with medical conditions should consult the doctor before taking this whey protein. In case of any discomfort, discontinue use & seek physician’s help."
        ],
        "Availibility": "In stock.",
        "CustomerReviews": "4.1"
    },
    {
        "ProductUrl": "https://www.amazon.in/dp/B07HJ4NPP2/",
        "ProductName": "MuscleBlaze Beginner's Whey Protein Supplement (Chocolate, 1 kg with Shaker)",
        "Price": "1,099.00",
        "ProductFeatures": [
            "12.0g of protein in 30g of serving (40%* of the serving) with Zero added sugar",
            "Whey Protein Concentrate is the primary source of protein in the product.",
            "5.5g of EAAs along with 2.6g of BCAA’s help keep the body in anabolic state and muscle gains post workout.",
            "The product is free from any banned substance or doping ingredients as per NADA/WADA list."
        ],
        "Availibility": "In stock.",
        "CustomerReviews": "3.8"
    },
    {
        "ProductUrl": "https://www.amazon.in/dp/B079KRJPZF/",
        "ProductName": "Advance Musclemass 100% Whey Isolate Whey Protein Supplement Powder With Digezyme - 1 Kg 2.2 Lb (33 Servings) (Chocolate Flavour)",
        "Price": "1,849.00",
        "ProductFeatures": [
            "Advance Whey Protein With 25.05G Protein And 11.36 G Eaa And 4.08 G Of Glutamine Per Serving Makes It The Best Whey Protein Supplement Powder",
            "Advance Iso-Whey Is Manufactured Using Whey Isolate From United States Of America Ensuring Protein Quality Of International Standards",
            "Whey Protein Isolate Is The Only Source Of Whey. Also Added Digezyme Advantage Digezyme Consists Of Various Digestive Enzymes Like Amylase, Protease, Cellulase, Lactase And Lipase Which Help To Digest Carbohydrates, Lactose, Cellulosic Fibres, Fats And Proteins And Also Keeps Your Digestive System Healthy",
            "Consumers Aiming For Muscle Gain Should Mix 1 Scoop (30G) In 180-200 Ml Water And Take 1-2 Shakes Per Day"
        ],
        "Availibility": "In stock.",
        "CustomerReviews": "4.5"
    },
    {
        "ProductUrl": "https://www.amazon.in/dp/B07D6ZR732/",
        "ProductName": "Himalaya Quista Pro Advanced Whey Protein Powder - 1kg (Chocolate)",
        "Price": "1,685.00",
        "ProductFeatures": [
            "Quista Pro contains 3 whey protein blend, concentrate, isolate and hydrolysate for faster absorption",
            "Fortified with peptides and taurine which minimize post injury workout and hasten recovery",
            "Quista Pro is enriched with herbal actives which develops bone health, build stamina and endurance",
            "Fortified with calcium and vitamins for better bone health",
            "Enriched with BCAA which improves exercise performance",
            "Faster recovery from muscle injury"
        ],
        "Availibility": "In stock.",
        "CustomerReviews": "3.8"
    },
    {
        "ProductUrl": "https://www.amazon.in/dp/B06XZCXKRP/",
        "ProductName": "Sinew Nutrition Instantized Raw & Real Whey Protein Isolate 92% - 840g (Unflavoured)",
        "Price": "1,469.00",
        "ProductFeatures": [
            "EXCEPTIONAL PROTEIN PROFILE: Each 30 gm serving of Sinew Nutrition Instantized Whey Protein Isolate provides premium quality and high performance protein with 27.6gm protein, 6.6gm BCAA and 5.1gm glutamine helping one build lean muscle.",
            "ADDED DIGESTIVE ENZYMES: Sinew Nutrition Whey Protein Isolate powder comes with the Added advantage of digestive enzymes. These help in the break down and then easier absorption of protein and lactose in the body.",
            "MINIMALLY PROCESSED: Each serving of 30gm denatured whey protein is minimally processed preserving the delicate nutrients found in natural whey protein powder. It contains no artificial sweetners, banned substances/flavors and is Gluten-free and Non-GMO.",
            "HIGH BIOLOGICAL VALUE PROTEIN:This superior American WHEY PROTEIN,has a biological value(150) to WPC’s 104.High biological value &fast digestion, leads to apt utilization. It's amino acid profile makes it usable for activation of muscle protein synthesis.",
            "ULTIMATE MUSCLE FUEL: A great amino profile makes it ideal to be used as a pre-workout and also as a post workout recovery drink supporting muscle protein synthesis. Low fat [0.4gm per 30gm] and carb content [0.6gm per 30gm] makes it ideal for the fitness freaks.",
            "EASY TO USE: This versatile protein can be easily added to one's diet in any form. One can add varying types of flavours and easily whip up smoothies, shakes, cookies or nutritional bars for a protein boost.",
            "CAUTION:This product contains milk & dairy derivatives, hence is not suitable for people with lactose intolerance. People with medical conditions should consult a doctor before taking this. In case of any discomfort discontinue use & seek physician’s help."
        ],
        "Availibility": "In stock.",
        "CustomerReviews": "4.3"
    },
    {
        "ProductUrl": "https://www.amazon.in/dp/B081VHDMPT/",
        "ProductName": "Guardian BigBolt 100% Whey Protein Chocolate Powder 2Kg",
        "Price": "2,499.00",
        "ProductFeatures": [
            "BigBolt 100% Whey is specially designed for early beginners & fitness enthusiasts, delivering a high quality protein formula with high amounts of naturally occurring amino acids needed everyday.",
            "Blend comprises of Whey Isolate & concentrate, with 24g of protein, 5.5g BCAA in each serving with zero added sugar.",
            "Recommended dosage is half scoop during non-training days, 1 scoop during cardio training, 1-2 scoops during weight training days and 2 scoops during sessions including both cardio & weight training.",
            "Serving Size is 36g & this pack contains 27 servings.",
            "Mix one scoop with 180-240 ml of water, milk or your favourite beverage."
        ],
        "Availibility": "In stock.",
        "CustomerReviews": "3.3"
    },
    {
        "ProductUrl": "https://www.amazon.in/dp/B07DZZYNMJ/",
        "ProductName": "MuscleBlaze Whey Protein Performance (1 Kg / 2.2 lb, Chocolate), 25 gm protein, 5.5 gm BCAA, 4,4 gm Glutamic Acid, with added vitamins",
        "Price": "1,299.00",
        "ProductFeatures": [
            "25.20g of protein in 36g of serving with Zero added sugar and Zero Trans Fats.",
            "Whey Performance is for core bodybuilders and athletes targeting muscle gain with Whey Protein Concentrate and Whey Protein Isolate being the quality source of protein of Whey Performance.",
            "Added vitamins to fulfill your micro-nutrients need.",
            "Every unit of the product will have an NABL accredited lab report against the product which can be accessed on muscleblaze website. The customer can check the amount and source of protein using the batch number of his/her Product.",
            "Peace of mind for customers through NABL accredited lab report for every consumer to test out the quantity & quality of protein."
        ],
        "Availibility": "In stock.",
        "CustomerReviews": "3.9"
    },
    {
        "ProductUrl": "https://www.amazon.in/dp/B07YX4VLC2/",
        "ProductName": "NAKPRO Perform Whey Protein Concentrate with Added Digestive Enzymes, Raw Whey Protein 1kg Supplement Powder - Unflavoured",
        "Price": "799.00",
        "ProductFeatures": [
            "Nakpro Perform Raw Whey Protein Concentrate Imported from USA, 24g Protein in 33g serve size with 5.7g of BCAA and 12.7g of EAAs and Glutamic Acid 4.7g",
            "All Natural : No Artificial Colour, flavour, additives, fillers. Zero Sugar and No Banned Substances & Chemicals.",
            "Builds Muscle Mass: Nakpro Perform Whey Protein Concentrate is Rich Source of Protein which helps to build lean muscle, enhances recovery, supports healthy metabolism and reduces muscle loss. bullet-point",
            "UNFLAVORED (Raw and Asitis) Whey protein concentrate best suited for any kind of shakes or drinks having instantly soluble ability and Pure VEGETARIAN Whey Protein.",
            "Readily dissolves in water or milk, No lumping or residue. Customers should mix 1 scoop (33g) in 180-200 ml water for best results."
        ],
        "Availibility": "In stock.",
        "CustomerReviews": "3.8"
    },
    {
        "ProductUrl": "https://www.amazon.in/dp/B07N6P2YZM/",
        "ProductName": "Tuff Up Raw Whey Protein Concentrate 80% (Unflavoured – 1 kg/2.2 lb)",
        "Price": "749.00",
        "ProductFeatures": [
            "Flexibility -Tuff Up raw whey is unflavoured and unsweetened in nature; It provides flexibility of Usage and freedom to add any flavours or make any recipe out of whey protein",
            "Use it to prepare your own protein dish – pancakes, bars, ice-creams, smoothies",
            "Zero Aspartame, Zero added sugar, No added flavours, Vegetarian source of protein",
            "5.2g of BCAAs to help with fast muscle synthesis",
            "Every product comes with a unique authenticity code using which the customer can confirm the genuineness of the product"
        ],
        "Availibility": "In stock.",
        "CustomerReviews": "3.9"
    },
    {
        "ProductUrl": "https://www.amazon.in/dp/B07X1JYQT3/",
        "ProductName": "Scitron Raw ISO (100% Whey Protein ISOLATE, 27g Protein, 0g Sugar, 30 Servings, Essential & Non-Essential Amino Acids, No Flavours & Preservatives) - 2 lbs (900g)",
        "Price": "1,149.00",
        "ProductFeatures": [
            "Provon (100% Whey Protein Isolate), which is a registered trademark of Glanbia Nutritionals",
            "Offers clean whey protein isolate with 27g protein ; Deliver greater gains in strength, muscle and lean body mass",
            "6.2g BCAA (naturally occurring) in every serving",
            "No added sugar, colour and flavour and delivers pure, high quality protein",
            "Whey protein enhances glutathione (GSH), whey protein isolate works on enhancing this system, leading to greater performance and increased immunity",
            "Soy Lecithin is used to instantize whey protein isolate during processing, however this is filtered out from the product"
        ],
        "Availibility": "In stock.",
        "CustomerReviews": "3.4"
    },
    {
        "ProductUrl": "https://www.amazon.in/dp/B07K7SV1QH/",
        "ProductName": "Labrada 100% Whey Protein Concentrate (26g Protein, 0g Sugar, 13 Servings) - 1.1 lbs (500g) (Chocolate)",
        "Price": "1,039.00",
        "ProductFeatures": [
            "26g Protein & 3.7g Carbohydrate with 0g sugar added to the product",
            "Perfect for athletes, fitness enthusiasts, bodybuilders, and dieters who want to supplement their nutrition with the highest-quality protein",
            "It is made using instantized whey protein concentrate, an excellent source of all the amino acids, including branched- chain amino acids and glutamine, which provide support for muscle tissue, and recovery from exercise",
            "Mixes easily with water, juice or milk. Use it to boost your protein intake at meals, or in-between meals as a snack"
        ],
        "Availibility": "In stock.",
        "CustomerReviews": "3.7"
    },
    {
        "ProductUrl": "https://www.amazon.in/dp/B07Q6Z2DVC/",
        "ProductName": "Labrada ISO WHEY 100% Whey Protein Isolate (Post Workout, 25g Protein, 0g Sugar,0 Fat,Gluten Free, Lactose Free, 66 Servings) - 4.4 lbs (2kg) (Chocolate)",
        "Price": "4,843.00",
        "ProductFeatures": [
            "Provides high strength.",
            "Helps in musclebuilding",
            "Has the highest protein."
        ],
        "Availibility": "In stock.",
        "CustomerReviews": "3.9"
    }
]